#include <iostream>
#include<cmath>

using namespace std;
int main() 
{       
    int p;
    cout << "Введите плотность нужного материала: ";
    cin >> p;

    if (p > 0 && p <= 1000)
    {
       cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
       p = 1000; 
    }
    else if (p > 1000 && p <=2400 )
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 2400;
    }
    else if (p > 2400 && p <= 2500)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 2500;
    }
    else if (p > 2500 && p <= 2600)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 2600;
    }
    else if (p > 2600 && p <= 7130)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 7130;
    }
    else if (p > 7130 && p <= 7200)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 7200;
    }
    else if (p > 7200 && p <= 7850)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 7850;
    }
    else if (p > 7850 && p <= 8900)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 8900;
    }
    else if (p > 8900 && p <= 11400)
    {
        cout << "Плотность не менее "<< p <<" г/ куб.дм имеют следующие материалы:" << endl;
        p = 11400;
    }
    
    switch(p)
    {
        case 1000:
        {
            cout << "Вода-1000" << endl;
            cout << "Бетон-2400" << endl;
            cout << "Алюминий-2500" << endl;
            cout << "Стекло-2600"  << endl;
            cout << "Чугун-7130" << endl;
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
        case 2400:
        {
            cout << "Бетон-2400" << endl;
            cout << "Алюминий-2500" << endl;
            cout << "Стекло-2600"  << endl;
            cout << "Чугун-7130" << endl;
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 2500:
        {
            cout << "Алюминий-2500" << endl;
            cout << "Стекло-2600"  << endl;
            cout << "Чугун-7130" << endl;
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
        case 2600:
        {
            cout << "Стекло-2600"  << endl;
            cout << "Чугун-7130" << endl;
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 7130:
        {
            cout << "Чугун-7130" << endl;
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 7200:
        {
            cout << "Цинк-7200" << endl;
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 7850:
        {
            cout << "Сталь-7850" << endl;
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 8900:
        {
            cout << "Медь-8900" << endl;
            cout << "Свинец-11400" << endl;
            break;
        }
         case 11400:
        {
            cout << "Свинец-11400" << endl;
            break;
        }
        default:
        {
            cout << "Такого значение плотности нет" << endl;
            return 0;
        }
    }
return 0;
}